import re
# \w - буква, цифра, _
# \W - все що не \w ,  # , ? , ,
# \d - цифра, 0-9
# \D - не цифра
# \s - Пробіл, таб
# \S - Не пробіл

test_patter = re.compile(r"\w\w\d")
# ab5, A_5, Xx9


# [a-z] - маленькі букви
# [A-Z] - тільки великі
# [0-9]
# [a-zA-Z0-9_] - всі символи логіна

# комбінування
# [abcXYZ] - тільки 6 символів
# [а-яА-Я] - тільки кирилиця

# Інверсія
# [^0-9] - будь що крім цифр
# [^a-zA-Z] - будь що крім букв


# Квантіфікатори - скільки символів потрібно в рядку
# * - 0 або більше - a* -> "" , a, aaa, aaaa
# + - 1 або більше - a+ - > a, aa, aaa,aaaa
# ? - 0 або 1  a? -> a , ""
# {n} рівно n разів  a{3} - > aaa
# {n,} мінімум n a{2,} -> aa, aaaa,aaaaaaa
# {n,m} від n до m   a{2,4} -> aa, aaa, aaaa

# шаблон для номеру телефона +380
test_2_pattern = re.compile(r"^\+380\d{9}$")

# (?=.*\d)   (?=.*[A-Z])  (?=.*[a-z]) (?=.*[!@#%^&*?]))

# password check
test_2_pattern = re.compile(r"^(?=.*\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@#%^&*?]).{6,20}$")


# login check
test_2_pattern = re.compile(r"^[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Za-z]{2,}$]")

test_text = input("Введи текст для перевірки: ")

if test_2_pattern.search(test_text):
    print("Да перевірку пройшов.")

else:
    print("Вибач дозвіл заборонено.")
